app/controllers/problems_controller.rb

  def show
    @problem = Problem.find(params[:id])
---
SELECT "problems".* FROM "problems" WHERE "problems"."id" = 1 LIMIT 1